PGM
DCL &VAR1 *CHAR 10
DCL &VAR2 *CHAR 10
DCL &VAR3 *CHAR 10
DCL &VAR4 *CHAR 10
DCL &VAR5 *CHAR 10

CHGVAR &VAR1 'XXXXXXXXXX'
CHGVAR &VAR2 &VAR1
CHGVAR &VAR3 &VAR2
CHGVAR &VAR4 &VAR3
CHGVAR &VAR5 &VAR4

/* Comment */
ENDPGM
